//KMP算法
/***********************************************************
KMP算法的思路复杂版：
字符串0号下标表示字符串长度。从而下标对应字符串位置，就很好表示。
以串"thisistheorderfromwys"与"thisl"为例
s1:21thisistheorderfromwys(i)
s2:5thisl(j)
i1=j1     i1!=i2   
得出
i2!=j1
同理
i3!=j1
...
i5!=j1
失配时，j1可直接跳到i6寻求下一段匹配
但如果i1=i2时，失配时j1需跳到i2寻求下一段匹配 
i1!=j1时，直接向右移动一格
新建k数组，目的为在当前位置失配时，下一次匹配改用哪一个位置的字符
进行匹配
-----------------------------------------------------------
KMP算法思路简易版：
每次匹配失败后，因为指针左侧字符串完全匹配，所以在该字符串中寻
找前后缀，前缀直接移动到后缀开始字符串匹配
-----------------------------------------------------------
以上为KMP算法思路
-----------------------------------------------------------
NEXT数组求解方法
-----------------------------------------------------------
该位字符串前最长公共前后缀长度+1
-----------------------------------------------------------
***********************************************************/

//获取next数组
typedef char *String;
void get_next(String T, int *next)
{
    int j = 0;
    int i = 1;
    next[1] = 0;
    while (i < T[0])
    {
        if (j == 0 || T[i] == T[j])
        {
            i++;
            j++;
            if (T[i] != T[j])
            {
                next[i] = j;
            }
            else
            {
                next[i] = next[j];
            }
        }
        else
        {
            j = next[j];
        }
    }
}

//KMP算法，返回字串T在主串S第pos个字符之后的位置
int Index_KMP(String S, String T, int pos)
{
    int i = pos;
    int j = 1;
    int next[255];

    get_next(T, next);

    while (i <= S[0] && j <= T[0])
    {
        if (S[i] == T[i])
        {
            i++;
            j++;
        }
        else
        {
            j = next[j];
        }
    }

    if (j > T[0])
    {
        return i - T[0];
    }
    else
    {
        return 0;
    }
}